simulations/batch5/sim14/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
	(-2.5 -2 -0.1)  // 0
	(2.5 -2 -0.1)   // 1
	(2.5 0.3 -0.1)  // 2
	(3.5 0.3 -0.1)  // 3
	(3.5 -2 -0.1)   // 4
	(8.5 -2 -0.1)   // 5
	(8.5 0.3 -0.1)  // 6
    (8.5 2.7 -0.1)  // 7
    (3.5 2.7 -0.1)  // 8
    (2.5 2.7 -0.1)  // 9
    (-2.5 2.7 -0.1) // 10
    (-2.5 0.3 -0.1) // 11
    (-2.5 -2 0.1)  // 12-0
	(2.5 -2 0.1)   // 13-1
	(2.5 0.3 0.1)  // 14-2
	(3.5 0.3 0.1)  // 15-3
	(3.5 -2 0.1)   // 16-4
	(8.5 -2 0.1)   // 17-5
	(8.5 0.3 0.1)  // 18-6
    (8.5 2.7 0.1)  // 19-7
    (3.5 2.7 0.1)  // 20-8
    (2.5 2.7 0.1)  // 21-9
    (-2.5 2.7 0.1) // 22-10
    (-2.5 0.3 0.1) // 23-11
);

blocks
(
    /* First block  LOWER-LEFT */ hex (0 1 2 11 12 13 14 23) (150 50 1) simpleGrading (1 1 1)
    /* Second block UPPER-LEFT */ hex (11 2 9 10 23 14 21 22) (150 100 1) simpleGrading (1 1 1)
    /* Third block MID-SECTION */ hex (2 3 8 9 14 15 20 21) (50 100 1) simpleGrading (1 1 1)
    /* Fourth block UPPER-RIGHT */ hex (3 6 7 8 15 18 19 20) (150 100 1) simpleGrading (1 1 1)
    /* Fifth block LOWER-RIGHT */ hex (4 5 6 3 16 17 18 15) (150 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary	
(
    left
    {
        type wall;
        faces
        (
            (10 11 23 22)
            (11 0 12 23)
        );
    }

    right
    {
        type wall;
        faces
        (
            (6 7 19 18)
            (5 6 18 17)
        );
    }

    top
    {
        type patch;
        faces
        (
            (9 10 22 21)
            (8 9 21 20)
            (7 8 20 19)
        );
    }

    bottom
    {
        type wall;
        faces
        (
            (0 1 13 12)
            (1 2 14 13)
            (2 3 15 14)
            (3 4 16 15)
            (4 5 17 16)   
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
